In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('insurance.csv')

In [3]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()
df8 = df.copy()
df9 = df.copy()
df10 = df.copy()
df11 = df.copy()
df12 = df.copy()
df13 = df.copy()

# Label Encoding

In [4]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [5]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [6]:
'''performing label encoding on sex, smoker, and region individually using sklearn library function'''

'performing label encoding on sex, smoker, and region individually using sklearn library function'

In [7]:
df['sex'] = le.fit_transform(df['sex'])

In [8]:
df['smoker'] = le.fit_transform(df['smoker'])

In [9]:
df['region'] = le.fit_transform(df['region'])

In [10]:
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

In [11]:
'''performing label encoding using for loop'''

'performing label encoding using for loop'

In [12]:
from pandas.core.dtypes.common import is_numeric_dtype

In [13]:
df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [14]:
for col in df1.columns:
    if is_numeric_dtype(df1[col]):
        continue
    df1[col] = le.fit_transform(df1[col])

In [15]:
df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One hot Encoding

In [16]:
'''performing one hot encoding on sex, smoker, and region individually using sklearn library function'''

'performing one hot encoding on sex, smoker, and region individually using sklearn library function'

In [17]:
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [18]:
dummies_s = pd.get_dummies(df2.sex) # creating dummy variables for sex using pandas get_dummies function

In [19]:
dummies_s.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [20]:
dummies_s = pd.get_dummies(df2.sex,drop_first=True, prefix='sex')

In [21]:
dummies_s.head()

   sex_male
0         0
1         1
2         1
3         1
4         1

In [22]:
df2.drop('sex', axis =1, inplace=True)

In [23]:
df2=pd.concat([df2,dummies_s],axis=1)

In [24]:
df2.head()

   age     bmi  children smoker     region      charges  sex_male
0   19  27.900         0    yes  southwest  16884.92400         0
1   18  33.770         1     no  southeast   1725.55230         1
2   28  33.000         3     no  southeast   4449.46200         1
3   33  22.705         0     no  northwest  21984.47061         1
4   32  28.880         0     no  northwest   3866.85520         1

In [25]:
dummies_m = pd.get_dummies(df3.smoker) # creating dummy variables for smoke using pandas get_dummies function

In [26]:
dummies_m.head()

   no  yes
0   0    1
1   1    0
2   1    0
3   1    0
4   1    0

In [27]:
dummies_m = pd.get_dummies(df3.smoker,drop_first=True, prefix='smoker')

In [28]:
dummies_m.head()

   smoker_yes
0           1
1           0
2           0
3           0
4           0

In [29]:
df2.drop('smoker', axis =1, inplace=True)

In [30]:
df2=pd.concat([df2,dummies_m],axis=1)

In [31]:
df2.head()

   age     bmi  children     region      charges  sex_male  smoker_yes
0   19  27.900         0  southwest  16884.92400         0           1
1   18  33.770         1  southeast   1725.55230         1           0
2   28  33.000         3  southeast   4449.46200         1           0
3   33  22.705         0  northwest  21984.47061         1           0
4   32  28.880         0  northwest   3866.85520         1           0

In [32]:
dummies_r = pd.get_dummies(df4.region) # creating dummy variables for smoke using pandas get_dummies function

In [33]:
dummies_r = pd.get_dummies(df4.region,drop_first=True, prefix='region')

In [34]:
dummies_r.head()

   region_northwest  region_southeast  region_southwest
0                 0                 0                 1
1                 0                 1                 0
2                 0                 1                 0
3                 1                 0                 0
4                 1                 0                 0

In [35]:
df2.drop('region', axis =1, inplace=True)

In [36]:
df2=pd.concat([df2,dummies_r],axis=1)

In [37]:
df2.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

In [38]:
'''one-hot encoding using for loop'''

'one-hot encoding using for loop'

In [39]:
df6.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [40]:
for col in df6.columns:
    if is_numeric_dtype(df6[col]):
        continue
    one = pd.get_dummies(df6[col],drop_first=True, prefix=col)    
    df6.drop(df6[[col]], axis =1, inplace=True) 
    df6=pd.concat([df6,one],axis=1)

In [41]:
df6.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal Encoding

In [42]:
from sklearn.preprocessing import OrdinalEncoder

In [43]:
df8.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [44]:
s = df8.sex.unique() # finding categories/unique values from sex

In [45]:
s

array(['female', 'male'], dtype=object)

In [46]:
enc = OrdinalEncoder(categories=[s]) # making an object of ordinal encoder with the categories sex

In [47]:
enc

OrdinalEncoder(categories=[array(['female', 'male'], dtype=object)])

In [48]:
df8['sex']=pd.DataFrame(enc.fit_transform(df8[['sex']]),columns=['sex'])

In [49]:
df8.head()

   age  sex     bmi  children smoker     region      charges
0   19  0.0  27.900         0    yes  southwest  16884.92400
1   18  1.0  33.770         1     no  southeast   1725.55230
2   28  1.0  33.000         3     no  southeast   4449.46200
3   33  1.0  22.705         0     no  northwest  21984.47061
4   32  1.0  28.880         0     no  northwest   3866.85520

In [50]:
sm = df8.smoker.unique() # finding categories/unique values from smoker

In [51]:
sm

array(['yes', 'no'], dtype=object)

In [52]:
enc_sm = OrdinalEncoder(categories=[sm]) # making an object of ordinal encoder with the categories smoker

In [53]:
enc_sm

OrdinalEncoder(categories=[array(['yes', 'no'], dtype=object)])

In [54]:
df8['smoker']=pd.DataFrame(enc_sm.fit_transform(df8[['smoker']]),columns=['smoker'])

In [55]:
df8.head()

   age  sex     bmi  children  smoker     region      charges
0   19  0.0  27.900         0     0.0  southwest  16884.92400
1   18  1.0  33.770         1     1.0  southeast   1725.55230
2   28  1.0  33.000         3     1.0  southeast   4449.46200
3   33  1.0  22.705         0     1.0  northwest  21984.47061
4   32  1.0  28.880         0     1.0  northwest   3866.85520

In [56]:
r = df8.region.unique() # finding categories/unique values from region

In [57]:
r

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [58]:
enc_r = OrdinalEncoder(categories=[r]) # making an object of ordinal encoder with the categories region

In [59]:
enc_r

OrdinalEncoder(categories=[array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)])

In [60]:
df8['region']=pd.DataFrame(enc_r.fit_transform(df8[['region']]),columns=['region'])

In [61]:
df8.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520

In [62]:
'''ordinal encoding using for loop'''

'ordinal encoding using for loop'

In [63]:
#for col in df10.columns:
#    if is_numeric_dtype(df10[col]):
#        continue
#    df10[col] = OrdinalEncoder().fit_transform(df10[[col]])

In [64]:
#df10.head()

In [65]:
for col in df12.columns:
    if is_numeric_dtype(df12[col]):
        continue 
    val =  df12[col].unique()
    df12[col] = OrdinalEncoder(categories=[val]).fit_transform(df12[[col]])

In [66]:
df12.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520